supermarket/app/views/suppliers/edit.html.erb

SELECT "categories".* FROM "categories"
---
		<p>
		<%= f.select :category_id, options_from_collection_for_select(Category.all, :id, :categoryName) %>