supermarket/app/views/suppliers/new.html.erb

		<p>
		<%= f.select :categories_id, options_from_collection_for_select(Category.all, :id, :categoryName) %>
---
SELECT "categories".* FROM "categories"