supermarket/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
def index
  @category = Category.all

INSERT INTO "categories" ("categoryName", "created_at", "updated_at") VALUES (?, ?, ?)  [["categoryName", "Bröd"], ["created_at", Sun, 13 May 2012 11:53:16 UTC +00:00], ["updated_at", Sun, 13 May 2012 11:53:16 UTC +00:00]]
---
def create
  @category = Category.new(params[:category])

  if @category.save