supermarket/app/controllers/suppliers_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IS NULL LIMIT 1
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IS NULL
---
def index
  @suppliers = Supplier.find(:all, :include => :Category)