supermarket/app/controllers/suppliers_controller.rb

def index
  @suppliers = Supplier.all
---
SELECT "suppliers".* FROM "suppliers"

def create
  @supplier = Supplier.new(params[:supplier])

  if @supplier.save
---
INSERT INTO "suppliers" ("address", "categories_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "fiskargatan 3453, kalmar"], ["categories_id", 1], ["created_at", Sun, 13 May 2012 08:40:17 UTC +00:00], ["name", "Ica"], ["updated_at", Sun, 13 May 2012 08:40:17 UTC +00:00]]

def show

  @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "1"]]

def edit
  @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "2"]]

def update
  @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(params[:supplier])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "suppliers" SET "city" = 'Oskarshamn', "updated_at" = '2012-05-15 10:13:54.213070' WHERE "suppliers"."id" = 1

def destroy
  @supplier = Supplier.find(params[:id])
    @supplier.destroy
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "suppliers" WHERE "suppliers"."id" = ?  [["id", 3]]